app/views/students/index.html.erb

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
            when "Working w/ Staff"
                student.destroy

SELECT "students"."created_at" FROM "students"
SELECT COUNT(*) AS count_all, floor AS floor FROM "students" GROUP BY "students"."floor"
---
<h1>Floor</h1>
<%= bar_chart Student.group(:floor).count %>

SELECT COUNT(*) AS count_all, seating_area AS seating_area FROM "students" GROUP BY "students"."seating_area"
---
<h1>Seating</h1>
<%= bar_chart Student.group(:seating_area).count %>

SELECT COUNT(*) AS count_all, technology AS technology FROM "students" GROUP BY "students"."technology"
---
<h1>Technology</h1>
<%= bar_chart Student.group(:technology).count %>

SELECT COUNT(*) AS count_all, activity AS activity FROM "students" GROUP BY "students"."activity"
---
<h1>Activity</h1>
<%= bar_chart Student.group(:activity).count %>