app/controllers/api/v1/students_controller.rb

SELECT "students".* FROM "students"
---
        def index
            respond_with Student.all