app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT "students"."created_at" FROM "students"